Revit 2027 API
BuiltInFailures.ElectricalFailures.InvalidApparentPowerDensity Property
 The Apparent Power Density is invalid. Edit the Power Density and/or Power Factor to recalculate the Apparent Power Density.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId InvalidApparentPowerDensity { get; }
Public Shared ReadOnly Property InvalidApparentPowerDensity As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ InvalidApparentPowerDensity {
	FailureDefinitionId^ get ();
}
static member InvalidApparentPowerDensity : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ElectricalFailures Class
Autodesk.Revit.DB Namespace